{
    "date"      : "09-01-2022",
    "isUsed"     : false,
    "categories" : [
        {
            "name"        : "Virtues",
            "description" : "A Quality of Moral Excellence.",
            "components"  : {

            "Temperance"  : [ 0, "Eat not to dullness. Drink not to elevation." ],
            "Silence"     : [ 0, "Speak not but what may benefit others or yourself. Avoid trifling conversation." ],
            "Order"       : [ 0, "Let all your things have their places. Let each part of your business have its time." ],
            "Resolution"  : [ 0, "Resolve to perform what you ought. Perform without fail what you resolve." ],
            "Frugality"   : [ 0, "Make no expense but to do good to others or yourself." ],
            "Industry"    : [ 0, "Lose no time. Be always employed in something useful. Cut off all unnecessary actions." ],
            "Sincerity"   : [ 0, "Use no hurtful deceit. Think innocently and justly; and if you speak, speak accordingly." ],
            "Justice"     : [ 0, "Wrong none by doing injuries, or omitting the benefits that are your duty." ],
            "Moderation"  : [ 0, "Avoid extremes. Forbear resenting injuries so much as you think they deserve." ],
            "Cleanliness" : [ 0, "Tolerate no uncleanness in body, clothes, or habitation." ],
            "Tranquility" : [ 0, "Be not disturbed at trifles, or at accidents common or unavoidable." ],
            "Chastity"    : [ 0, "Rarely use venery but for health or offspring" ],
            "Humility"    : [ 0, "Imitate Muhammed, Isa, Socrates, et al."  ]

            }
        },
        {
            "name"        : "Goals",
            "description" : "The Object of Effort.",
            "components"  : {

                "Learn Conversational Shqip" : [ 0, "Anything that helps unlock the Albanian language in the spoken and/or written word." ],
                "Become a Software Engineer" : [ 0, "Anything that helps develop your skills and creditentials when it comes to software engineering." ],
                "Earn More Than Expenses"    : [ 0, "Earn more than expenses, at least a monthly 5'000 AED as it would help a lot. Next goal would be to earn expenses from \"rents\": i.e., stable & automatic income." ]

            }
        },
        {
            "name"        : "Habits",
            "description" : "An Automatic Tendency.",
            "components"  : {

                "10 Push Ups a Day"         : [ 0, "Focus on Form; Establish a Routine. Ideal: 100 per day." ],
                "Sleep before Midnight"     : [ 0, "Focus on Form; Establish a Routine. Ideal: Early enough to wake up before or around the Fajr azan." ],
                "Read for 20 minutes a Day" : [ 0, "Focus on Form; Establish a Routine. Ideal: 4 hours every day." ]

            }
        },
        {
            "name"        : "Projects",
            "description" : "The Achievement of an Aim.",
            "components"  : {

                "Create a Bug Tracker"        : [ 0, "Make one that looks and works good since this project is alledgedly valuable to your portfolio." ],
                "Create a Business Scorecard" : [ 0, "Learn how to make and implement a business scorecard." ],
                "Learn Basic Shqip Grammar"   : [ 0, "Learn the Albanian Grammar rules when it comes to plural, adjectives, sex, ordinals, tense, and definites." ],
                "Low Poly Skyrim"             : [ 0, "Add the ENBs and mods to play Skyrim in low-poly." ],
                "Learn the Basics of ClamAV"  : [ 0, "Learn how to schedule scans, scan new items, update virus-recognition DB." ]


            }
        }

    ]
}